#+TITLE: Design of Simple Machine Elements
#+SUBTITLE: ME 310: Mechanical Design
#+AUTHOR: Sappinandana Akamphon

#+OPTIONS: toc:nil timestamp:nil H:2 title:t
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [10pt, svgnames]
#+BEAMER_THEME: metropolis
#+LATEX_COMPILER: xelatex
#+BEAMER_HEADER: \usepackage{booktabs}
#+BEAMER_HEADER: \usepackage{pgfplots}
#+BEAMER_HEADER: \usepackage{multirow}
#+BEAMER_HEADER: \usepackage{smartdiagram}
#+BEAMER_HEADER: \pgfplotsset{compat=1.18}
#+BEAMER_HEADER: \definecolor{lightblue}{RGB}{180,220,255}
#+BEAMER_HEADER: \institute{Department of Mechanical Engineering, TSE}
#+BEAMER_HEADER: \date{}
#+BEAMER_HEADER: \usetikzlibrary{patterns,shapes,arrows}
#+BEAMER_HEADER: \AtBeginSection[]{\begin{frame}{Outline}\tableofcontents[currentsection]\end{frame}}

** Calculating the ratio

#+BEGIN_SRC python :session column-bending :exports none
designation = ['S610 x 149', 'S510 x 143', 'S460 x 104', 'S380 x 74', 'S310 x 74', 'S250 x 52']
Area = [18900*10**-6, 18200*10**-6, 13200*10**-6, 9480*10**-6, 9420*10**-6, 6650*10**-6]
S = [3260 * 10**-6, 2700 * 10**-6, 1690*10**-6, 1060*10**-6, 829*10**-6, 482*10**-6]
#+END_SRC

#+RESULTS:

- We need to determine the ratio $\dfrac{\sigma _a}{(\sigma_a)_{allow}} + \dfrac{\sigma_b}{(\sigma_b)_{allow}}$
- For steel, $(\sigma_a)_{allow} = (\sigma_b)_{allow} = \sigma_{allow}$
- As a sample calculation,

#+BEGIN_SRC python :session column-bending :exports results :results raw output
print(r'\begin{align*}')
print(r'&\sigma_a = \frac{' + str(F_col) + r'}{' + str(Area[0]) + r'} =' + str(F_col/Area[0]) + r'\text{ Pa} \\')
print(r'&\sigma_b = \frac{' + str(round(M)) + r'}{' + str(S[0]) + r'} = ' + str(M/S[0]) + r'\text{ Pa} \\')
print(r'&\frac{\sigma_a + \sigma_b}{\sigma_{allow}} = ' + str(round((F_col/Area[0] + M/S[0])/sigma_allow,2)))
print(r'\end{align*}')
#+END_SRC

#+RESULTS:
\begin{align*}
&\sigma_a = \frac{50000.0}{0.0189} =2645502.6455026455\text{ Pa} \\
&\sigma_b = \frac{50000}{0.00326} = 15337423.312883437\text{ Pa} \\
&\frac{\sigma_a + \sigma_b}{\sigma_{allow}} = 0.18
\end{align*}

** Solution

  Use data table to generate results

\small
#+BEGIN_SRC python :results output raw :session column-bending :exports results
print(r'\begin{tabular}{lccc}')
print(r'\toprule')
print(r'Designation & Axial Stress & Bending Stress & $\dfrac{\sigma _a + \sigma_b}{\sigma_{allow}}$ \\')
print(r'\midrule')
for i in [0,1,2,3,4,5]:
  print(r'%s & %.2e & %.2e & %.2f \\' % (designation[i], F_col/Area[i], M/S[i], (F_col/Area[i] + M/S[i])/sigma_allow))
print(r'\bottomrule')
print(r'\end{tabular}')
#+END_SRC

#+RESULTS:
\begin{tabular}{lccc}
\toprule
Designation & Axial Stress & Bending Stress & $\dfrac{\sigma _a + \sigma_b}{\sigma_{allow}}$ \\
\midrule
S610 x 149 & 2.65e+06 & 1.53e+07 & 0.18 \\
S510 x 143 & 2.75e+06 & 1.85e+07 & 0.21 \\
S460 x 104 & 3.79e+06 & 2.96e+07 & 0.33 \\
S380 x 74 & 5.27e+06 & 4.72e+07 & 0.52 \\
S310 x 74 & 5.31e+06 & 6.03e+07 & 0.66 \\
S250 x 52 & 7.52e+06 & 1.04e+08 & 1.11 \\
\bottomrule
\end{tabular}

\normalsize
In this case, S310 x 74 is our pick.

# ** {Wooden Columns}
#
#   - Slenderness ratio from $h$, the smallest dimension of the cross section
#     $$ \text{slenderness ratio} = \lambda = \frac{KL}{h}$$
#   - Design equation dependent on properties: $E, S_y$
#
#
# % ** {Wooden Column Design Equations}
#
#   - For wood with $S_{uc}$ = 8.27 MPa and $E$ = 12.4 GPa
#
#   \begin{equation*}
#   \sigma_{allow} = \left\{
#     \begin{array}{l c}
#       8.27 \times 10^6 & 0 \leqslant \lambda \leqslant 11 \\
#       8.27 \times 10^6\left[ 1 - \dfrac{1}{3} \left( \dfrac{\lambda}{26} \right)^2 \right] & 11 \leqslant \lambda \leqslant 26 \\
#       \dfrac{3.72 \times 10^9}{\lambda^2} & 26 \leqslant \lambda \leqslant 50
#     \end{array} \right.
# \end{equation*}
#
# % ** {Wooden Columns}
#   \footnotesize
#   \begin{tikzpicture}
#     \begin{axis}[
#       width=0.9\textwidth,
#       height=.6\textwidth,
#       xmin=0,xmax=50,
#       xlabel={$\lambda$},
#       ylabel={$\dfrac{\sigma_{allow}}{S_{uc}}$},
#       ylabel style={rotate=-90},
#       cycle list name=exotic,
#       samples=100,
#       no markers,
#       every axis plot/.append style={thick},
#       ]
#       \addplot [domain=0:11, DarkBlue]{1} node[midway, below]{short};
#       \addplot [domain=11:26, DarkRed]{(1-1/3*(x/26)^2)} node[midway, above right]{medium};
#       \addplot [domain=26:50, DarkGrey!20!Black] {450/x^2} node[midway, above right]{long};
#     \end{axis}
#   \end{tikzpicture}
#
# % ** {Aluminum Columns}
#
#   - For 2014-T6 Aluminum $S_y$ = 193 MPa, $E$ = 70 GPa
#
#   \begin{equation*}
#     \sigma_{allow} = \left\{
#       \begin{array}{l c}
#         1.93 \times 10^8 &  0 \leqslant \lambda \leqslant 12 \\[20pt]
#         2.12 \times 10^8 - 1.59 \times 10^6 \lambda & 12 \leqslant \lambda \leqslant 55 \\[20pt]
#         \dfrac{3.72 \times 10^{11}}{\lambda^2} & 55 \leqslant \lambda
#       \end{array} \right.
#   \end{equation*}
#
# % ** {Aluminum Column Design Equations}
#   \scriptsize
#   \begin{tikzpicture}
#     \begin{axis}[
#       width=0.9\textwidth,
#       height=.6\textwidth,
#       xmin=0,xmax=100,
#       xlabel={$\lambda$},
#       ylabel={$\dfrac{\sigma_{allow}}{S_{comp}}$},
#       ylabel style={rotate=-90},
#       cycle list name=exotic,
#       samples=100,
#       no markers,
#       every axis plot/.append style={thick},
#       ]
#       \addplot [domain=0:12, DarkBlue]{1} node[midway, below]{short};
#       \addplot [domain=12:55, DarkRed]{(2.12*10^8-1.59*10^6*x)/(1.93*10^8)} node[midway, above right]{medium};
#       \addplot [domain=55:100, DarkGrey!20!Black] {1928/x^2} node[midway, above right]{long};
#     \end{axis}
#   \end{tikzpicture}
#
# % ** {Column Design Procedures}
#   \scriptsize
#   \centering
#   \adjustbox{valign=t}{
#     \begin{tikzpicture}[>=latex, every node/.style={fill=LightSkyBlue}]
#       \node[draw](load){Determine Compressive Load};
#       \node [yshift=1cm, fill=none] {\normalsize Theory};
#       \node[draw, yshift=-1cm, xshift=0cm](ratio){$\lambda_c$};
#       \node[draw, yshift=-2cm, xshift=-1cm, text width=1.3cm, align=center](buckling){Buckling Design};
#       \node[draw, yshift=-2cm, xshift=1cm, text width=1.3cm, align=center](comp){Strength Design};
#       \node[draw, yshift=-3cm, xshift=0cm](check){Check slenderness ratio};
#       \draw[->] (load) -- (ratio);
#       \draw[->] (ratio) -- (buckling) node[midway, left, fill=none]{More};
#       \draw[->] (ratio) -- (comp) node[midway, right, fill=none]{Less};
#       \draw[->] (buckling) -- (check);
#       \draw[->] (comp) -- (check);
#     \end{tikzpicture}
#   }
#   \hspace{1cm}
#   \adjustbox{valign=t}{
#     \begin{tikzpicture}[>=latex, every node/.style={fill=LightSkyBlue}]
#       \node[draw](load){Determine Compressive Load};
#       \node [yshift=1cm, fill=none] {\normalsize Practical};
#       \node[draw, yshift=-1cm, xshift=0cm](ratio){Evaluate slenderness};
#       \node[draw, yshift=-2cm, xshift=0cm, text width=1.3cm, align=center](comp){Design Equation};
#       \node[draw, yshift=-3cm, xshift=0cm](spread){Spreadsheet};
#       \node[draw, yshift=-4cm, xshift=0cm](check){Check slenderness ratio};
#       \draw[->] (load) -- (ratio);
#       \draw[->] (ratio) -- (comp);
#       \draw[->] (comp) -- (spread);
#       \draw[->] (spread) -- (check);
#     \end{tikzpicture}
#   }
#

